{"_id":{"$oid":"63f952b70ffad218259a73d2"},"Name":"Peter Jackson","Bio":"Peter Jackson is a New Zealand film director, producer, and screenwriter. He is best known for his epic adaptations of J.R.R. Tolkiens The Lord of the Rings and The Hobbit novels, which have won numerous awards and critical acclaim.","Birthyear":1961,"Deathyear":"--"}
{"_id":{"$oid":"63f952b70ffad218259a73d3"},"Name":"The Wachowski Brothers","Bio":"Lana Wachowski and Lilly Wachowski, known together professionally as the Wachowskis, are American film and television directors, writers, and producers. They are best known for creating The Matrix franchise, as well as other critically acclaimed works like Cloud Atlas and Sense8.","Birthyear":1965,"Deathyear":"--"}
{"_id":{"$oid":"63f952b70ffad218259a73d4"},"Name":"Ridley Scott","Bio":"Ridley Scott is an English film director and producer known for his visually stunning and thematically rich films. He has directed numerous critically acclaimed movies, including Alien, Blade Runner, and Gladiator, and has received several Academy Award nominations throughout his career.","Birthyear":1937,"Deathyear":"--"}
{"_id":{"$oid":"63f952b70ffad218259a73d5"},"Name":"Bob Persichetti, Peter Ramsey, and Rodney Rothman","Bio":"Bob Persichetti, Peter Ramsey, and Rodney Rothman are American film directors and screenwriters. They are known for their work on Spider-Man: Into the Spider-Verse, which won the Academy Award for Best Animated Feature in 2019.","Birthyear":"--","Deathyear":"--"}
{"_id":{"$oid":"63f952b70ffad218259a73d6"},"Name":"Joseph Kosinski","Bio":"Joseph Kosinski is a director whose uncompromising style has quickly made a mark in the filmmaking zeitgeist. His feature film debut, \"Tron: Legacy\" for Walt Disney Studios, grossed over $400 million worldwide","Birthyear":1974,"Deathyear":"--"}
{"_id":{"$oid":"63f952b70ffad218259a73d7"},"Name":"Robert Zemeckis","Bio":"Robert Zemeckis is an American film director, producer, and screenwriter, born on May 14, 1951, in Chicago, Illinois. He is best known for directing and co-writing several critically acclaimed and commercially successful films.","Birthyear":1951,"Deathyear":"--"}
{"_id":{"$oid":"63fad1854d53a750451846e0"},"Name":"Christopher Nolan","Bio":"Christopher Nolan is a British-American film director, producer, and screenwriter. He is known for his unique storytelling style, often involving time and perception, and has directed several critically acclaimed and commercially successful films, including Memento, The Dark Knight, and Interstellar.","Birthyear":1970,"Deathyear":"--"}
{"_id":{"$oid":"63fad1c14d53a750451846e1"},"Name":"Daniel kwan","Bio":"Daniel Kwan is a filmmaker and writer born in 1984 in Los Angeles, best known as one half of the directing duo \"The Daniels\" with Daniel Scheinert, who gained recognition for their unique visual style and imaginative storytelling, and have directed numerous music videos, commercials, and short films.","Birthyear":1984,"Deathyear":"--","Director":{"Bio":"Daniel Kwan is a LA-born filmmaker and writer, renowned for co-directing the unique and imaginative films, music videos, and commercials as one half of The Daniels duo with Daniel Scheinert."}}
